app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 101], ["created_at", "2020-03-23 18:37:47.045680"], ["updated_at", "2020-03-23 18:37:47.045680"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:room_number, :title))
    if @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 102], ["updated_at", "2020-03-23 18:41:35.510507"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
      if @school_class.update_attributes(params.require(:school_class).permit(:room_number, :title))