app/controllers/students_controller.rb

def index
    @sstudents = Student.all
---
SELECT "students".* FROM "students"

  def create
    @student = Student.new(params.require(:student).permit(:first_name, :title))
    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "David"], ["last_name", "Van Fleet"], ["created_at", "2020-03-23 18:20:54.265495"], ["updated_at", "2020-03-23 18:20:54.265495"]]

  def update
    @student = Student.find(params[:id])
      if @student.update_attributes(params.require(:student).permit(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "David"], ["last_name", "VanFleet"], ["updated_at", "2020-03-23 18:45:13.537634"], ["id", 5]]